Product - AIM/sample messages/body-aim-returnstatus-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/RetrieveStatus</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:RetrieveStatus xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnStatusRequestMsg>
                <fil:RetrieveStatusRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/RetrieveStatusRequest">
                    <ret2:retrieveFormInfoRequest xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>v2</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" IdentifierValueType="ACCIRD">123090918</com:identifier>
                        <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">INC</com:accountType>
                        <ret2:periodEndDate>2019-08-31</ret2:periodEndDate>
                        <ret2:majorFormType>SOA</ret2:majorFormType>
                        <ret2:minorFormType>SOA_2</ret2:minorFormType>
                    </ret2:retrieveFormInfoRequest>
                </fil:RetrieveStatusRequestWrapper>
            </ret:ReturnStatusRequestMsg>
        </ret:RetrieveStatus>
    </soap:Body>
</soap:Envelope>